![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a biblioteca Pandas.\
Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.\
Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

#### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/users_dataset.txt***.\
Salve os dados em uma variável de nome *users*.

In [26]:
!dir

 O volume na unidade C é Windows
 O Número de Série do Volume é CA2E-86B6

 Pasta de C:\Users\henri\Downloads\br-python-challenges-master\Exercícios semana 6

04/08/2021  15:41    <DIR>          .
04/08/2021  15:41    <DIR>          ..
04/08/2021  14:58    <DIR>          .ipynb_checkpoints
04/08/2021  15:40    <DIR>          datasets
04/08/2021  15:36            23.900 Manipulacao_de_Dados_Ex_01.ipynb
04/08/2021  15:40            47.090 Manipulacao_de_Dados_Ex_02.ipynb
04/08/2021  15:12             7.419 Manipulacao_de_Dados_Ex_03.ipynb
04/08/2021  09:24                29 README.md
04/02/2021  10:47            22.667 users_dataset.csv
04/02/2021  10:47             5.052 US_Crime_Rates_1960_2014.csv
               6 arquivo(s)        106.157 bytes
               4 pasta(s)   770.452.971.520 bytes disponíveis

In [27]:
import pandas as pd

In [28]:
df = pd.read_csv("datasets/users_dataset.csv",sep="|")

In [29]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

#### Tarefa 2. Descubra qual a idade média por ocupação.

*Dica: use a função groupby do Pandas na coluna occupation*

In [37]:
df.groupby("occupation").mean().agg({"age":["mean", "std"]})

            age
mean  36.598950
std    7.952457

#### Tarefa 3. Para cada ocupação descubra a idade mínima e máxima.

In [39]:
df.groupby("occupation").agg({"age":["min", "max"]})

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

#### Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

Exemplo:

```
occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
```

In [43]:
df.groupby("occupation").mean().agg({"age":["mean", "std"]})

            age
mean  36.598950
std    7.952457

#### Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres.

Exemplo:

```
occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
```

In [ ]:
# Seu código

**Parabéns! Você chegou ao fim!**